Catalogs/ШаблоныИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ШаблоныИнформационныхКарт</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчитываемаяДорожка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ограничения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛево</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПраво</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОперацияЛево</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОперацияПраво</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныИнформационныхКарт/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СчитываемаяДорожкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.СчитываемаяДорожка = 2;

КонецПроцедуры // СчитываемаяДорожкаОчистка()


&НаКлиенте
Процедура ОграниченияЗначениеЛевоПриИзменении(Элемент)
	
	Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево = СокрЛ(Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево);
	Если Не ПустаяСтрока(Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво) Тогда
		Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво = Макс(Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево, Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво);
	КонецЕсли;
	
КонецПроцедуры // ОграниченияЗначениеЛевоПриИзменении()

&НаКлиенте
Процедура ОграниченияЗначениеПравоПриИзменении(Элемент)
	
	Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво = СокрЛ(Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво);
	Если Не ПустаяСтрока(Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево) Тогда
		Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево = Мин(Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево, Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво);
	КонецЕсли;
	
КонецПроцедуры // ОграниченияЗначениеПравоПриИзменении()

&НаКлиенте
Процедура ОграниченияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		
		Если ПустаяСтрока(Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево) И ПустаяСтрока(Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво) Тогда
			Объект.Ограничения.Удалить(Элементы.Ограничения.ТекущиеДанные);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОграниченияПриОкончанииРедактирования()
